<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Category;

class CategorySeeder extends Seeder
{
    public function run(): void
    {
        $categories = [

            ['code'=>'000','name'=>'คอมพิวเตอร์ ความรู้ทั่วไป'],
            ['code'=>'010','name'=>'บรรณานุกรม แคตตาล็อก'],
            ['code'=>'020','name'=>'บรรณารักษศาสตร์และสารนิเทศศาสตร์'],
            ['code'=>'030','name'=>'หนังสือรวบรวมความรู้ทั่วไป สารานุกรม'],
            ['code'=>'040','name'=>'ยังไม่กำหนดใช้'],
            ['code'=>'050','name'=>'สิ่งพิมพ์ต่อเนื่อง วารสาร และดรรชนี'],
            ['code'=>'060','name'=>'องค์การต่างๆ พิพิธภัณฑวิทยา'],
            ['code'=>'070','name'=>'วารสารศาสตร์ การพิมพ์'],
            ['code'=>'080','name'=>'ชุมนุมนิพนธ์'],
            ['code'=>'090','name'=>'ต้นฉบับตัวเขียน หนังสือหายาก'],

            ['code'=>'100','name'=>'ปรัชญา'],
            ['code'=>'110','name'=>'อภิปรัชญา'],
            ['code'=>'120','name'=>'ญาณวิทยา ความเป็นเหตุผล ความเป็นมนุษย์'],
            ['code'=>'130','name'=>'จิตวิทยานามธรรม'],
            ['code'=>'140','name'=>'แนวความคิดปรัชญาเฉพาะกลุ่ม'],
            ['code'=>'150','name'=>'จิตวิทยา'],
            ['code'=>'160','name'=>'ตรรกศาสตร์ ตรรกวิทยา'],
            ['code'=>'170','name'=>'จริยศาสตร์ ศีลธรรม'],
            ['code'=>'180','name'=>'ปรัชญาสมัยโบราณ สมัยกลาง ตะวันออก'],
            ['code'=>'190','name'=>'ปรัชญาตะวันตกสมัยใหม่'],

            ['code'=>'200','name'=>'ศาสนา'],
            ['code'=>'210','name'=>'ศาสนาธรรมชาติ'],
            ['code'=>'220','name'=>'ไบเบิล'],
            ['code'=>'230','name'=>'เทววิทยาตามแนวคริสต์ศาสนา'],
            ['code'=>'240','name'=>'ศีลธรรมชาวคริสต์'],
            ['code'=>'250','name'=>'คริสต์ศาสนาในท้องถิ่น'],
            ['code'=>'260','name'=>'สังคมชาวคริสต์'],
            ['code'=>'270','name'=>'ประวัติคริสต์ศาสนา'],
            ['code'=>'280','name'=>'นิกายต่างๆ ในคริสต์ศาสนา'],
            ['code'=>'290','name'=>'ศาสนาเปรียบเทียบและศาสนาอื่นๆ'],

            ['code'=>'300','name'=>'สังคมศาสตร์'],
            ['code'=>'310','name'=>'สถิติศาสตร์'],
            ['code'=>'320','name'=>'รัฐศาสตร์ การเมือง การปกครอง'],
            ['code'=>'330','name'=>'เศรษฐศาสตร์'],
            ['code'=>'340','name'=>'กฎหมาย'],
            ['code'=>'350','name'=>'รัฐประศาสนศาสตร์'],
            ['code'=>'360','name'=>'ปัญหาสังคม'],
            ['code'=>'370','name'=>'การศึกษา'],
            ['code'=>'380','name'=>'การพาณิชย์ การสื่อสาร การขนส่ง'],
            ['code'=>'390','name'=>'ประเพณี ขนบธรรมเนียม คติชนวิทยา'],

            ['code'=>'400','name'=>'ภาษา'],
            ['code'=>'410','name'=>'ภาษาศาสตร์'],
            ['code'=>'420','name'=>'ภาษาอังกฤษ'],
            ['code'=>'430','name'=>'ภาษาเยอรมัน'],
            ['code'=>'440','name'=>'ภาษาฝรั่งเศส'],
            ['code'=>'450','name'=>'ภาษาอิตาลี'],
            ['code'=>'460','name'=>'ภาษาสเปน ภาษาโปรตุเกส'],
            ['code'=>'470','name'=>'ภาษาละติน'],
            ['code'=>'480','name'=>'ภาษากรีก'],
            ['code'=>'490','name'=>'ภาษาอื่นๆ'],

            ['code'=>'500','name'=>'วิทยาศาสตร์'],
            ['code'=>'510','name'=>'คณิตศาสตร์'],
            ['code'=>'520','name'=>'ดาราศาสตร์'],
            ['code'=>'530','name'=>'ฟิสิกส์'],
            ['code'=>'540','name'=>'เคมี'],
            ['code'=>'550','name'=>'วิทยาศาสตร์โลก'],
            ['code'=>'560','name'=>'บรรพชีวินวิทยา'],
            ['code'=>'570','name'=>'ชีววิทยา'],
            ['code'=>'580','name'=>'พฤกษศาสตร์'],
            ['code'=>'590','name'=>'สัตววิทยา'],

            ['code'=>'600','name'=>'วิทยาศาสตร์ประยุกต์ เทคโนโลยี'],
            ['code'=>'610','name'=>'แพทยศาสตร์'],
            ['code'=>'620','name'=>'วิศวกรรมศาสตร์'],
            ['code'=>'630','name'=>'เกษตรศาสตร์'],
            ['code'=>'640','name'=>'คหกรรมศาสตร์'],
            ['code'=>'650','name'=>'การจัดการธุรกิจ'],
            ['code'=>'660','name'=>'วิศวกรรมเคมี'],
            ['code'=>'670','name'=>'โรงงานอุตสาหกรรม'],
            ['code'=>'680','name'=>'สินค้าที่ผลิตจากเครื่องจักร'],
            ['code'=>'690','name'=>'การก่อสร้าง'],

            ['code'=>'700','name'=>'ศิลปกรรม การบันเทิง'],
            ['code'=>'710','name'=>'ภูมิสถาปัตย์'],
            ['code'=>'720','name'=>'สถาปัตยกรรม'],
            ['code'=>'730','name'=>'ประติมากรรม'],
            ['code'=>'740','name'=>'การวาดเขียน มัณฑนศิลป์'],
            ['code'=>'750','name'=>'จิตรกรรม'],
            ['code'=>'760','name'=>'ศิลปะการพิมพ์'],
            ['code'=>'770','name'=>'การถ่ายรูป'],
            ['code'=>'780','name'=>'ดนตรี'],
            ['code'=>'790','name'=>'การบันเทิง นันทนาการ กีฬา'],

            ['code'=>'800','name'=>'วรรณกรรม วรรณคดี'],
            ['code'=>'810','name'=>'วรรณคดีอเมริกัน'],
            ['code'=>'820','name'=>'วรรณคดีภาษาอังกฤษ'],
            ['code'=>'830','name'=>'วรรณคดีภาษาเยอรมัน'],
            ['code'=>'840','name'=>'วรรณคดีภาษาฝรั่งเศส'],
            ['code'=>'850','name'=>'วรรณคดีภาษาอิตาลี'],
            ['code'=>'860','name'=>'วรรณคดีภาษาสเปน'],
            ['code'=>'870','name'=>'วรรณคดีภาษาละติน'],
            ['code'=>'880','name'=>'วรรณคดีภาษากรีก'],
            ['code'=>'890','name'=>'วรรณคดีภาษาอื่นๆ'],

            ['code'=>'900','name'=>'ประวัติศาสตร์ ภูมิศาสตร์'],
            ['code'=>'910','name'=>'ภูมิศาสตร์ การท่องเที่ยว'],
            ['code'=>'920','name'=>'ชีวประวัติ'],
            ['code'=>'930','name'=>'ประวัติศาสตร์ยุคโบราณ'],
            ['code'=>'940','name'=>'ประวัติศาสตร์ยุโรป'],
            ['code'=>'950','name'=>'ประวัติศาสตร์เอเชีย'],
            ['code'=>'960','name'=>'ประวัติศาสตร์แอฟริกา'],
            ['code'=>'970','name'=>'ประวัติศาสตร์อเมริกาเหนือ'],
            ['code'=>'980','name'=>'ประวัติศาสตร์อเมริกาใต้'],
            ['code'=>'990','name'=>'ประวัติศาสตร์ส่วนอื่นๆ ของโลก'],
        ];

        foreach($categories as $category){
            Category::updateOrCreate(
                ['code' => $category['code']],
                [
                    'name' => $category['name'],
                    'status' => 1,
                ]
            );
        }
    }
}
